real_runs/a100_qwen7b/verify/qwen7b/gpu_a100/verify_code_instructcoder/logs/bench_client.log
INFO 07-15 07:24:22 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x764dc4dcf600>, seed=0, num_prompts=200, dataset_name='hf', no_stream=True, dataset_path='/home/ubuntu/LLM/real_runs/datasets/instructcoder', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split='train', hf_name='likaixin/InstructCoder', hf_output_len=200, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=18201, endpoint='/v1/completions', max_concurrency=None, model='Qwen/Qwen2.5-Coder-7B-Instruct', tokenizer='Qwen/Qwen2.5-Coder-7B-Instruct', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['max_model_len=32768'], result_dir='/home/ubuntu/LLM/real_runs/a100_qwen7b/verify/qwen7b/gpu_a100/verify_code_instructcoder/results', result_filename='bench_serve.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='qwen7b-gpu_a100', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:01 elapsed, 644:56:47 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [01:41<00:00,  1.97it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  101.30    
Total input tokens:                      36530     
Total generated tokens:                  26914     
Request throughput (req/s):              1.97      
Output token throughput (tok/s):         265.68    
Total Token throughput (tok/s):          626.30    
---------------Time to First Token----------------
Mean TTFT (ms):                          35.18     
Median TTFT (ms):                        34.68     
P99 TTFT (ms):                           49.73     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.05     
Median TPOT (ms):                        13.96     
P99 TPOT (ms):                           15.30     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.04     
Median ITL (ms):                         13.44     
P99 ITL (ms):                            27.04     
==================================================